pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6041.h
/* LCDCMEMCTL Control Bits */
#define LCDDISP                          (0x0001)        /* Select LCD memory registers for display */
#define LCDDISP_L                        (0x0001)
#define LCDDISP_0                        (0x0000)        /* Display content of LCD memory registers LCDM */
#define LCDDISP_1                        (0x0001)        /* Display content of LCD blinking memory registers LCDBM */
#define LCDDISP_1_L                      (0x0001)
#define LCDCLRM                          (0x0002)        /* Clear LCD memory */
#define LCDCLRM_L                        (0x0002)
#define LCDCLRM_0                        (0x0000)        /* Contents of LCD memory registers LCDMx remain unchanged */
#define LCDCLRM_1                        (0x0002)        /* Clear content of all LCD memory registers LCDM */
#define LCDCLRM_1_L                      (0x0002)
#define LCDCLRBM                         (0x0004)        /* Clear LCD blinking memory */
#define LCDCLRBM_L                       (0x0004)
#define LCDCLRBM_0                       (0x0000)        /* Contents of blinking memory registers LCDBM remain unchanged */
#define LCDCLRBM_1                       (0x0004)        /* Clear content of all blinking memory registers LCDBM */
#define LCDCLRBM_1_L                     (0x0004)

/* LCDCVCTL Control Bits */
#define LCD2B                            (0x0001)        /* Bias select */
#define LCD2B_L                          (0x0001)
#define LCD2B_0                          (0x0000)        /* 1/3 bias */
#define LCD2B_1                          (0x0001)        /* 1/2 bias */
#define LCD2B_1_L                        (0x0001)
#define VLCDREF                          (0x0006)        /* Charge pump reference select */
#define VLCDREF_L                        (0x0006)
#define VLCDREF0                         (0x0002)        /* Charge pump reference select */
#define VLCDREF0_L                       (0x0002)
#define VLCDREF1                         (0x0004)        /* Charge pump reference select */
#define VLCDREF1_L                       (0x0004)
#define VLCDREF_0                        (0x0000)        /* Internal reference voltage */
#define VLCDREF_1                        (0x0002)        /* External reference voltage */
#define VLCDREF_1_L                      (0x0002)
#define VLCDREF_2                        (0x0004)        /* Internal reference voltage switched to external pin LCDREF/R13 */
#define VLCDREF_2_L                      (0x0004)
#define VLCDREF_3                        (0x0006)        /* Reserved (defaults to external reference voltage) */
#define VLCDREF_3_L                      (0x0006)
#define LCDCPEN                          (0x0008)        /* Charge pump enable */
#define LCDCPEN_L                        (0x0008)
#define LCDCPEN_0                        (0x0000)        /* Charge pump disabled */
#define LCDCPEN_1                        (0x0008)        /* Charge pump enabled when VLCD is generated internally (VLCDEXT
                                                            = 0) and VLCD > 0 or VLCDREF > 0 */
#define LCDCPEN_1_L                      (0x0008)
#define VLCDEXT                          (0x0010)        /* VLCD source select */
#define VLCDEXT_L                        (0x0010)
#define VLCDEXT_0                        (0x0000)        /* VLCD is generated internally */
#define VLCDEXT_1                        (0x0010)        /* VLCD is sourced externally */
#define VLCDEXT_1_L                      (0x0010)
#define LCDEXTBIAS                       (0x0020)        /* V2 to V4 voltage select */
#define LCDEXTBIAS_L                     (0x0020)
#define LCDEXTBIAS_0                     (0x0000)        /* V2 to V4 are generated internally */
#define LCDEXTBIAS_1                     (0x0020)        /* V2 to V4 are sourced externally and the internal bias 
                                                            generator is switched off */
#define LCDEXTBIAS_1_L                   (0x0020)
#define R03EXT                           (0x0040)        /* V5 voltage select */
#define R03EXT_L                         (0x0040)
#define R03EXT_0                         (0x0000)        /* V5 is VSS */
#define R03EXT_1                         (0x0040)        /* V5 is sourced from the R03 pin */
#define R03EXT_1_L                       (0x0040)
#define R03EXT__VSS                      (0x0000)        /* V5 is VSS */
#define R03EXT__R03                      (0x0040)        /* V5 is sourced from the R03 pin */
#define R03EXT__R03_L                    (0x0040)
#define LCDREXT                          (0x0080)        /* V2 to V4 voltage on external Rx3 pins */
#define LCDREXT_L                        (0x0080)
#define LCDREXT_0                        (0x0000)        /* Internally generated V2 to V4 are not switched to pins 
                                                            (LCDEXTBIAS = 0) */
#define LCDREXT_1                        (0x0080)        /* Internally generated V2 to V4 are switched to pins (LCDEXTBIAS
                                                            = 0) */
#define LCDREXT_1_L                      (0x0080)
#define VLCD                             (0x1e00)        /* Charge pump voltage select */
#define VLCD_H                           (0x001e)
#define VLCD0                            (0x0200)        /* Charge pump voltage select */
#define VLCD0_H                          (0x0002)
#define VLCD1                            (0x0400)        /* Charge pump voltage select */
#define VLCD1_H                          (0x0004)
#define VLCD2                            (0x0800)        /* Charge pump voltage select */
#define VLCD2_H                          (0x0008)
#define VLCD3                            (0x1000)        /* Charge pump voltage select */
#define VLCD3_H                          (0x0010)
#define VLCD_0                           (0x0000)        /* Charge pump disabled */
#define VLCD_1                           (0x0200)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V; If VLCDREF = 01 or 11: 
                                                            VLCD = 2.17 * VREF */
#define VLCD_1_H                         (0x0002)
#define VLCD_2                           (0x0400)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_2_H                         (0x0004)
#define VLCD_3                           (0x0600)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_3_H                         (0x0006)
#define VLCD_4                           (0x0800)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_4_H                         (0x0008)
#define VLCD_5                           (0x0a00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_5_H                         (0x000a)
#define VLCD_6                           (0x0c00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_6_H                         (0x000c)
#define VLCD_7                           (0x0e00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_7_H                         (0x000e)
#define VLCD_8                           (0x1000)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_8_H                         (0x0010)
#define VLCD_9                           (0x1200)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_9_H                         (0x0012)
#define VLCD_10                          (0x1400)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_10_H                        (0x0014)
#define VLCD_11                          (0x1600)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_11_H                        (0x0016)
#define VLCD_12                          (0x1800)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_12_H                        (0x0018)
#define VLCD_13                          (0x1a00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_13_H                        (0x001a)
#define VLCD_14                          (0x1c00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD_14_H                        (0x001c)
#define VLCD_15                          (0x1e00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (15  1) * 0.06 V = 3.44
                                                            V; If VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (15  1) * 0.05 
                                                            * VREF = 2.87 * VREF */
#define VLCD_15_H                        (0x001e)
#define VLCD__DISABLED                   (0x0000)        /* Charge pump disabled */
#define VLCD__2_60                       (0x0200)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V; If VLCDREF = 01 or 11: 
                                                            VLCD = 2.17 * VREF */
#define VLCD__2_60_H                     (0x0002)
#define VLCD__2_66                       (0x0400)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_66_H                     (0x0004)
#define VLCD__2_72                       (0x0600)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_72_H                     (0x0006)
#define VLCD__2_78                       (0x0800)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_78_H                     (0x0008)
#define VLCD__2_84                       (0x0a00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_84_H                     (0x000a)
#define VLCD__2_90                       (0x0c00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_90_H                     (0x000c)
#define VLCD__2_96                       (0x0e00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__2_96_H                     (0x000e)
#define VLCD__3_02                       (0x1000)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_02_H                     (0x0010)
#define VLCD__3_08                       (0x1200)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_08_H                     (0x0012)
#define VLCD__3_14                       (0x1400)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_14_H                     (0x0014)
#define VLCD__3_20                       (0x1600)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_20_H                     (0x0016)
#define VLCD__3_26                       (0x1800)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_26_H                     (0x0018)
#define VLCD__3_32                       (0x1a00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_32_H                     (0x001a)
#define VLCD__3_38                       (0x1c00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (VLCD  1) * 0.06 V; If 
                                                            VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (VLCD  1) * 0.05 * 
                                                            VREF */
#define VLCD__3_38_H                     (0x001c)
#define VLCD__3_44                       (0x1e00)        /* If VLCDREF = 00 or 10: VLCD = 2.60 V + (15  1) * 0.06 V = 3.44
                                                            V; If VLCDREF = 01 or 11: VLCD = 2.17 * VREF + (15  1) * 0.05 
                                                            * VREF = 2.87 * VREF */
#define VLCD__3_44_H                     (0x001e)

/* LCDCPCTL0 Control Bits */
#define LCDS0                            (0x0001)        /* LCD segment line 0 enable */
#define LCDS0_L                          (0x0001)
#define LCDS0_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS0_1                          (0x0001)        /* Pins are LCD functions */
#define LCDS0_1_L                        (0x0001)
#define LCDS1                            (0x0002)        /* LCD segment line 1 enable */
#define LCDS1_L                          (0x0002)
#define LCDS1_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS1_1                          (0x0002)        /* Pins are LCD functions */
#define LCDS1_1_L                        (0x0002)
#define LCDS2                            (0x0004)        /* LCD segment line 2 enable */
#define LCDS2_L                          (0x0004)
#define LCDS2_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS2_1                          (0x0004)        /* Pins are LCD functions */
#define LCDS2_1_L                        (0x0004)
#define LCDS3                            (0x0008)        /* LCD segment line 3 enable */
#define LCDS3_L                          (0x0008)
#define LCDS3_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS3_1                          (0x0008)        /* Pins are LCD functions */
#define LCDS3_1_L                        (0x0008)
#define LCDS4                            (0x0010)        /* LCD segment line 4 enable */
#define LCDS4_L                          (0x0010)
#define LCDS4_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS4_1                          (0x0010)        /* Pins are LCD functions */
#define LCDS4_1_L                        (0x0010)
#define LCDS5                            (0x0020)        /* LCD segment line 5 enable */
#define LCDS5_L                          (0x0020)
#define LCDS5_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS5_1                          (0x0020)        /* Pins are LCD functions */
#define LCDS5_1_L                        (0x0020)
#define LCDS6                            (0x0040)        /* LCD segment line 6 enable */
#define LCDS6_L                          (0x0040)
#define LCDS6_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS6_1                          (0x0040)        /* Pins are LCD functions */
#define LCDS6_1_L                        (0x0040)
#define LCDS7                            (0x0080)        /* LCD segment line 7 enable */
#define LCDS7_L                          (0x0080)
#define LCDS7_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS7_1                          (0x0080)        /* Pins are LCD functions */
#define LCDS7_1_L                        (0x0080)
#define LCDS8                            (0x0100)        /* LCD segment line 8 enable */
#define LCDS8_H                          (0x0001)
#define LCDS8_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS8_1                          (0x0100)        /* Pins are LCD functions */
#define LCDS8_1_H                        (0x0001)
#define LCDS9                            (0x0200)        /* LCD segment line 9 enable */
#define LCDS9_H                          (0x0002)
#define LCDS9_0                          (0x0000)        /* Multiplexed pins are port functions */
#define LCDS9_1                          (0x0200)        /* Pins are LCD functions */
#define LCDS9_1_H                        (0x0002)
#define LCDS10                           (0x0400)        /* LCD segment line 10 enable */
#define LCDS10_H                         (0x0004)
#define LCDS10_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS10_1                         (0x0400)        /* Pins are LCD functions */
#define LCDS10_1_H                       (0x0004)
#define LCDS11                           (0x0800)        /* LCD segment line 11 enable */
#define LCDS11_H                         (0x0008)
#define LCDS11_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS11_1                         (0x0800)        /* Pins are LCD functions */
#define LCDS11_1_H                       (0x0008)
#define LCDS12                           (0x1000)        /* LCD segment line 12 enable */
#define LCDS12_H                         (0x0010)
#define LCDS12_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS12_1                         (0x1000)        /* Pins are LCD functions */
#define LCDS12_1_H                       (0x0010)
#define LCDS13                           (0x2000)        /* LCD segment line 13 enable */
#define LCDS13_H                         (0x0020)
#define LCDS13_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS13_1                         (0x2000)        /* Pins are LCD functions */
#define LCDS13_1_H                       (0x0020)
#define LCDS14                           (0x4000)        /* LCD segment line 14 enable */
#define LCDS14_H                         (0x0040)
#define LCDS14_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS14_1                         (0x4000)        /* Pins are LCD functions */
#define LCDS14_1_H                       (0x0040)
#define LCDS15                           (0x8000)        /* LCD segment line 15 enable */
#define LCDS15_H                         (0x0080)
#define LCDS15_0                         (0x0000)        /* Multiplexed pins are port functions */
#define LCDS15_1                         (0x8000)        /* Pins are LCD functions */
#define LCDS15_1_H                       (0x0080)

