pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6041.h
/* LCDCIV Control Bits */
#define LCDCIV0                          (0x0001)        /* LCD_C interrupt vector value */
#define LCDCIV0_L                        (0x0001)
#define LCDCIV1                          (0x0002)        /* LCD_C interrupt vector value */
#define LCDCIV1_L                        (0x0002)
#define LCDCIV2                          (0x0004)        /* LCD_C interrupt vector value */
#define LCDCIV2_L                        (0x0004)
#define LCDCIV3                          (0x0008)        /* LCD_C interrupt vector value */
#define LCDCIV3_L                        (0x0008)
#define LCDCIV4                          (0x0010)        /* LCD_C interrupt vector value */
#define LCDCIV4_L                        (0x0010)
#define LCDCIV5                          (0x0020)        /* LCD_C interrupt vector value */
#define LCDCIV5_L                        (0x0020)
#define LCDCIV6                          (0x0040)        /* LCD_C interrupt vector value */
#define LCDCIV6_L                        (0x0040)
#define LCDCIV7                          (0x0080)        /* LCD_C interrupt vector value */
#define LCDCIV7_L                        (0x0080)
#define LCDCIV8                          (0x0100)        /* LCD_C interrupt vector value */
#define LCDCIV8_H                        (0x0001)
#define LCDCIV9                          (0x0200)        /* LCD_C interrupt vector value */
#define LCDCIV9_H                        (0x0002)
#define LCDCIV10                         (0x0400)        /* LCD_C interrupt vector value */
#define LCDCIV10_H                       (0x0004)
#define LCDCIV11                         (0x0800)        /* LCD_C interrupt vector value */
#define LCDCIV11_H                       (0x0008)
#define LCDCIV12                         (0x1000)        /* LCD_C interrupt vector value */
#define LCDCIV12_H                       (0x0010)
#define LCDCIV13                         (0x2000)        /* LCD_C interrupt vector value */
#define LCDCIV13_H                       (0x0020)
#define LCDCIV14                         (0x4000)        /* LCD_C interrupt vector value */
#define LCDCIV14_H                       (0x0040)
#define LCDCIV15                         (0x8000)        /* LCD_C interrupt vector value */
#define LCDCIV15_H                       (0x0080)
#define LCDCIV_0                         (0x0000)        /* No interrupt pending */
#define LCDCIV_2                         (0x0002)        /* Interrupt Source: No capacitor connected; Interrupt Flag: 
                                                            LCDNOCAPIFG; Interrupt Priority: Highest */
#define LCDCIV_2_L                       (0x0002)
#define LCDCIV_4                         (0x0004)        /* Interrupt Source: Blink, segments off; Interrupt Flag: 
                                                            LCDBLKOFFIFG */
#define LCDCIV_4_L                       (0x0004)
#define LCDCIV_6                         (0x0006)        /* Interrupt Source: Blink, segments on; Interrupt Flag: 
                                                            LCDBLKONIFG */
#define LCDCIV_6_L                       (0x0006)
#define LCDCIV_8                         (0x0008)        /* Interrupt Source: Frame interrupt; Interrupt Flag: LCDFRMIFG; 
                                                            Interrupt Priority: Lowest */
#define LCDCIV_8_L                       (0x0008)
#define LCDCIV__NONE                     (0x0000)        /* No interrupt pending */
#define LCDCIV__LCDNOCAPIFG              (0x0002)        /* Interrupt Source: No capacitor connected; Interrupt Flag: 
                                                            LCDNOCAPIFG; Interrupt Priority: Highest */
#define LCDCIV__LCDNOCAPIFG_L            (0x0002)
#define LCDCIV__LCDBLKOFFIFG             (0x0004)        /* Interrupt Source: Blink, segments off; Interrupt Flag: 
                                                            LCDBLKOFFIFG */
#define LCDCIV__LCDBLKOFFIFG_L           (0x0004)
#define LCDCIV__LCDBLKONIFG              (0x0006)        /* Interrupt Source: Blink, segments on; Interrupt Flag: 
                                                            LCDBLKONIFG */
#define LCDCIV__LCDBLKONIFG_L            (0x0006)
#define LCDCIV__LCDFRMIFG                (0x0008)        /* Interrupt Source: Frame interrupt; Interrupt Flag: LCDFRMIFG; 
                                                            Interrupt Priority: Lowest */
#define LCDCIV__LCDFRMIFG_L              (0x0008)


/*****************************************************************************
 LEA Registers
*****************************************************************************/

#define __MSP430_HAS_LEA__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_LEA__ 0x0A80
#define LEA_BASE               __MSP430_BASEADDRESS_LEA__

sfr_l(LEACAP);                                /* LEA Capability Register */
sfr_w(LEACAPL);
sfr_w(LEACAPH);
sfr_l(LEACNF0);                               /* Configuration Register 0 */
sfr_w(LEACNF0L);
sfr_w(LEACNF0H);
sfr_l(LEACNF1);                               /* Configuration Register 1 */
sfr_w(LEACNF1L);
sfr_w(LEACNF1H);
sfr_l(LEACNF2);                               /* Configuration Register 2 */
sfr_w(LEACNF2L);
sfr_w(LEACNF2H);
sfr_l(LEAMB);                                 /* Memory Bottom Register */
sfr_w(LEAMBL);
sfr_w(LEAMBH);
sfr_l(LEAMT);                                 /* Memory Top Register */
sfr_w(LEAMTL);
sfr_w(LEAMTH);
sfr_l(LEACMA);                                /* Code Memory Access Register */
sfr_w(LEACMAL);
sfr_w(LEACMAH);
sfr_l(LEACMCTL);                              /* Code Memory Control Register */
sfr_w(LEACMCTLL);
sfr_w(LEACMCTLH);
sfr_l(LEACMDSTAT);                            /* LEA Command Status Register */
sfr_w(LEACMDSTATL);
sfr_w(LEACMDSTATH);
sfr_l(LEAS1STAT);                             /* LEA Source 1 Status Register */
sfr_w(LEAS1STATL);
sfr_w(LEAS1STATH);
sfr_l(LEAS0STAT);                             /* LEA Source 0 Status Register */
sfr_w(LEAS0STATL);
sfr_w(LEAS0STATH);
sfr_l(LEADSTSTAT);                            /* LEA Result Status Register */
sfr_w(LEADSTSTATL);
sfr_w(LEADSTSTATH);
sfr_l(LEAPMCTL);                              /* PM Control Register */
sfr_w(LEAPMCTLL);
sfr_w(LEAPMCTLH);
sfr_l(LEAPMDST);                              /* PM Result Register */
sfr_w(LEAPMDSTL);
sfr_w(LEAPMDSTH);
sfr_l(LEAPMS1);                               /* PM Source 1 Register */
sfr_w(LEAPMS1L);
sfr_w(LEAPMS1H);
sfr_l(LEAPMS0);                               /* PM Source 0 Register */
sfr_w(LEAPMS0L);
sfr_w(LEAPMS0H);
sfr_l(LEAPMCB);                               /* PM Command Buffer Register */
sfr_w(LEAPMCBL);
sfr_w(LEAPMCBH);
sfr_l(LEAIFGSET);                             /* Interrupt Flag and Set Register */
sfr_w(LEAIFGSETL);
sfr_w(LEAIFGSETH);
sfr_l(LEAIE);                                 /* Interrupt Enable Register */
sfr_w(LEAIEL);
sfr_w(LEAIEH);
sfr_l(LEAIFG);                                /* Interrupt Flag and Clear Register */
sfr_w(LEAIFGL);
sfr_w(LEAIFGH);
sfr_l(LEAIV);                                 /* Interrupt Vector Register */
sfr_w(LEAIVL);
sfr_w(LEAIVH);

/* LEA Register Offsets */
#define OFS_LEACAP                       (0x0000)
#define OFS_LEACAP_L                     OFS_LEACAP
#define OFS_LEACAP_H                     OFS_LEACAP+2
#define OFS_LEACNF0                      (0x0004)
#define OFS_LEACNF0_L                    OFS_LEACNF0
#define OFS_LEACNF0_H                    OFS_LEACNF0+2
#define OFS_LEACNF1                      (0x0008)
#define OFS_LEACNF1_L                    OFS_LEACNF1
#define OFS_LEACNF1_H                    OFS_LEACNF1+2
#define OFS_LEACNF2                      (0x000C)
#define OFS_LEACNF2_L                    OFS_LEACNF2
#define OFS_LEACNF2_H                    OFS_LEACNF2+2
#define OFS_LEAMB                        (0x0010)
#define OFS_LEAMB_L                      OFS_LEAMB
#define OFS_LEAMB_H                      OFS_LEAMB+2
#define OFS_LEAMT                        (0x0014)
#define OFS_LEAMT_L                      OFS_LEAMT
#define OFS_LEAMT_H                      OFS_LEAMT+2
#define OFS_LEACMA                       (0x0018)
#define OFS_LEACMA_L                     OFS_LEACMA
#define OFS_LEACMA_H                     OFS_LEACMA+2
#define OFS_LEACMCTL                     (0x001C)
#define OFS_LEACMCTL_L                   OFS_LEACMCTL
#define OFS_LEACMCTL_H                   OFS_LEACMCTL+2
#define OFS_LEACMDSTAT                   (0x0028)
#define OFS_LEACMDSTAT_L                 OFS_LEACMDSTAT
#define OFS_LEACMDSTAT_H                 OFS_LEACMDSTAT+2
#define OFS_LEAS1STAT                    (0x002C)
#define OFS_LEAS1STAT_L                  OFS_LEAS1STAT
#define OFS_LEAS1STAT_H                  OFS_LEAS1STAT+2
#define OFS_LEAS0STAT                    (0x0030)
#define OFS_LEAS0STAT_L                  OFS_LEAS0STAT
#define OFS_LEAS0STAT_H                  OFS_LEAS0STAT+2
#define OFS_LEADSTSTAT                   (0x0034)
#define OFS_LEADSTSTAT_L                 OFS_LEADSTSTAT
#define OFS_LEADSTSTAT_H                 OFS_LEADSTSTAT+2
#define OFS_LEAPMCTL                     (0x0040)
#define OFS_LEAPMCTL_L                   OFS_LEAPMCTL
#define OFS_LEAPMCTL_H                   OFS_LEAPMCTL+2
#define OFS_LEAPMDST                     (0x0044)
#define OFS_LEAPMDST_L                   OFS_LEAPMDST
#define OFS_LEAPMDST_H                   OFS_LEAPMDST+2
#define OFS_LEAPMS1                      (0x0048)
#define OFS_LEAPMS1_L                    OFS_LEAPMS1
#define OFS_LEAPMS1_H                    OFS_LEAPMS1+2
#define OFS_LEAPMS0                      (0x004C)
#define OFS_LEAPMS0_L                    OFS_LEAPMS0
#define OFS_LEAPMS0_H                    OFS_LEAPMS0+2
#define OFS_LEAPMCB                      (0x0050)
#define OFS_LEAPMCB_L                    OFS_LEAPMCB
#define OFS_LEAPMCB_H                    OFS_LEAPMCB+2
#define OFS_LEAIFGSET                    (0x0070)
#define OFS_LEAIFGSET_L                  OFS_LEAIFGSET
#define OFS_LEAIFGSET_H                  OFS_LEAIFGSET+2
#define OFS_LEAIE                        (0x0074)
#define OFS_LEAIE_L                      OFS_LEAIE
#define OFS_LEAIE_H                      OFS_LEAIE+2
#define OFS_LEAIFG                       (0x0078)
#define OFS_LEAIFG_L                     OFS_LEAIFG
#define OFS_LEAIFG_H                     OFS_LEAIFG+2
#define OFS_LEAIV                        (0x007C)
#define OFS_LEAIV_L                      OFS_LEAIV
#define OFS_LEAIV_H                      OFS_LEAIV+2

