pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6041.h
/* SAPH_AMIS Control Bits */
#define DATAERR                          (0x0001)        /* */
#define DATAERR_L                        (0x0001)
#define TMFTO                            (0x0002)        /* */
#define TMFTO_L                          (0x0002)
#define SEQDN                            (0x0004)        /* */
#define SEQDN_L                          (0x0004)
#define PNGDN                            (0x0008)        /* */
#define PNGDN_L                          (0x0008)

/* SAPH_ARIS Control Bits */
#define DAV                              (0x4000)        /* */
#define DAV_H                            (0x0040)

/* SAPH_AKEY Control Bits */
#define KEY                              (0x454b)        /* KEYID Key and ID */
#define KEY_L                            (0x004b)
#define KEY_H                            (0x0045)
#define KEY0                             (0x0001)        /* KEYID Key and ID */
#define KEY0_L                           (0x0001)
#define KEY1                             (0x0002)        /* KEYID Key and ID */
#define KEY1_L                           (0x0002)
#define KEY2                             (0x0004)        /* KEYID Key and ID */
#define KEY2_L                           (0x0004)
#define KEY3                             (0x0008)        /* KEYID Key and ID */
#define KEY3_L                           (0x0008)
#define KEY4                             (0x0010)        /* KEYID Key and ID */
#define KEY4_L                           (0x0010)
#define KEY5                             (0x0020)        /* KEYID Key and ID */
#define KEY5_L                           (0x0020)
#define KEY6                             (0x0040)        /* KEYID Key and ID */
#define KEY6_L                           (0x0040)
#define KEY7                             (0x0080)        /* KEYID Key and ID */
#define KEY7_L                           (0x0080)
#define KEY8                             (0x0100)        /* KEYID Key and ID */
#define KEY8_H                           (0x0001)
#define KEY9                             (0x0200)        /* KEYID Key and ID */
#define KEY9_H                           (0x0002)
#define KEY10                            (0x0400)        /* KEYID Key and ID */
#define KEY10_H                          (0x0004)
#define KEY11                            (0x0800)        /* KEYID Key and ID */
#define KEY11_H                          (0x0008)
#define KEY12                            (0x1000)        /* KEYID Key and ID */
#define KEY12_H                          (0x0010)
#define KEY13                            (0x2000)        /* KEYID Key and ID */
#define KEY13_H                          (0x0020)
#define KEY14                            (0x4000)        /* KEYID Key and ID */
#define KEY14_H                          (0x0040)
#define KEY15                            (0x8000)        /* KEYID Key and ID */
#define KEY15_H                          (0x0080)

/* SAPH_AOCTL0 Control Bits */
#define CH0OE                            (0x0001)        /* */
#define CH0OE_L                          (0x0001)
#define CH0OE_0                          (0x0000)        /* Ch0 Output is HiZ */
#define CH0OE_1                          (0x0001)        /* CH0 Output is driving */
#define CH0OE_1_L                        (0x0001)
#define CH1OE                            (0x0002)        /* */
#define CH1OE_L                          (0x0002)
#define CH1OE_0                          (0x0000)        /* Ch1 Output is HiZ */
#define CH1OE_1                          (0x0002)        /* CH1 Output is driving */
#define CH1OE_1_L                        (0x0002)
#define CH0OUT                           (0x0100)        /* */
#define CH0OUT_H                         (0x0001)
#define CH0OUT_0                         (0x0000)        /* Ch0 is set to low signal */
#define CH0OUT_1                         (0x0100)        /* Ch0 is set to high signal */
#define CH0OUT_1_H                       (0x0001)
#define CH1OUT                           (0x0200)        /* */
#define CH1OUT_H                         (0x0002)
#define CH1OUT_0                         (0x0000)        /* Ch1 is set to low signal */
#define CH1OUT_1                         (0x0200)        /* Ch1 is set to high signal */
#define CH1OUT_1_H                       (0x0002)

/* SAPH_AOCTL1 Control Bits */
#define CH0TERM                          (0x0001)        /* */
#define CH0TERM_L                        (0x0001)
#define CH0TERM_0                        (0x0000)        /* CH0 Output is defined by CH0OUT and CH0OE */
#define CH0TERM_1                        (0x0001)        /* CH0 Output is set low with termination strength */
#define CH0TERM_1_L                      (0x0001)
#define CH1TERM                          (0x0002)        /* */
#define CH1TERM_L                        (0x0002)
#define CH1TERM_0                        (0x0000)        /* CH1 Output is defined by CH1OUT and CH1OE */
#define CH1TERM_1                        (0x0002)        /* CH1 Output is set low with termination strength */
#define CH1TERM_1_L                      (0x0002)
#define CH0FP                            (0x0100)        /* */
#define CH0FP_H                          (0x0001)
#define CH0FP_0                          (0x0000)        /* Ch0 Output is set to normal strength */
#define CH0FP_1                          (0x0100)        /* Ch0 Output is set to maximum strength */
#define CH0FP_1_H                        (0x0001)
#define CH1FP                            (0x0200)        /* */
#define CH1FP_H                          (0x0002)
#define CH1FP_0                          (0x0000)        /* Ch1 Output is set to normal strength */
#define CH1FP_1                          (0x0200)        /* Ch1 Output is set to maximum strength */
#define CH1FP_1_H                        (0x0002)

/* SAPH_AOSEL Control Bits */
#define PCH0SEL                          (0x0003)        /* */
#define PCH0SEL_L                        (0x0003)
#define PCH0SEL0                         (0x0001)        /* */
#define PCH0SEL0_L                       (0x0001)
#define PCH0SEL1                         (0x0002)        /* */
#define PCH0SEL1_L                       (0x0002)
#define PCH0SEL_0                        (0x0000)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL_1                        (0x0001)        /* CH0_OUT is driven by the PPG. */
#define PCH0SEL_1_L                      (0x0001)
#define PCH0SEL_2                        (0x0002)        /* CH0_OUT is driven by the PPG as differential output along with
                                                            CH1_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity) */
#define PCH0SEL_2_L                      (0x0002)
#define PCH0SEL_3                        (0x0003)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL_3_L                      (0x0003)
#define PCH0SEL__GPIO                    (0x0000)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL__PPGSE                   (0x0001)        /* CH0_OUT is driven by the PPG. */
#define PCH0SEL__PPGSE_L                 (0x0001)
#define PCH1SEL                          (0x000c)        /* */
#define PCH1SEL_L                        (0x000c)
#define PCH1SEL0                         (0x0004)        /* */
#define PCH1SEL0_L                       (0x0004)
#define PCH1SEL1                         (0x0008)        /* */
#define PCH1SEL1_L                       (0x0008)
#define PCH1SEL_0                        (0x0000)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL_1                        (0x0004)        /* CH1_OUT is driven by the PPG. */
#define PCH1SEL_1_L                      (0x0004)
#define PCH1SEL_2                        (0x0008)        /* CH1_OUT is driven by the PPG as differential output along with
                                                            CH0_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity) */
#define PCH1SEL_2_L                      (0x0008)
#define PCH1SEL_3                        (0x000c)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL_3_L                      (0x000c)
#define PCH1SEL__GPIO                    (0x0000)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL__PPGSE                   (0x0004)        /* CH1_OUT is driven by the PPG. */
#define PCH1SEL__PPGSE_L                 (0x0004)

/* SAPH_ACH0PUT Control Bits */
#define CH0PUT                           (0x000f)        /* */
#define CH0PUT_L                         (0x000f)
#define CH0PUT0                          (0x0001)        /* */
#define CH0PUT0_L                        (0x0001)
#define CH0PUT1                          (0x0002)        /* */
#define CH0PUT1_L                        (0x0002)
#define CH0PUT2                          (0x0004)        /* */
#define CH0PUT2_L                        (0x0004)
#define CH0PUT3                          (0x0008)        /* */
#define CH0PUT3_L                        (0x0008)

/* SAPH_ACH0PDT Control Bits */
#define CH0PDT                           (0x000f)        /* */
#define CH0PDT_L                         (0x000f)
#define CH0PDT0                          (0x0001)        /* */
#define CH0PDT0_L                        (0x0001)
#define CH0PDT1                          (0x0002)        /* */
#define CH0PDT1_L                        (0x0002)
#define CH0PDT2                          (0x0004)        /* */
#define CH0PDT2_L                        (0x0004)
#define CH0PDT3                          (0x0008)        /* */
#define CH0PDT3_L                        (0x0008)

/* SAPH_ACH0TT Control Bits */
#define CH0TT                            (0x000f)        /* */
#define CH0TT_L                          (0x000f)
#define CH0TT0                           (0x0001)        /* */
#define CH0TT0_L                         (0x0001)
#define CH0TT1                           (0x0002)        /* */
#define CH0TT1_L                         (0x0002)
#define CH0TT2                           (0x0004)        /* */
#define CH0TT2_L                         (0x0004)
#define CH0TT3                           (0x0008)        /* */
#define CH0TT3_L                         (0x0008)

